#+TITLE: PURE-ECE notes and resources
#+AUTHOR: Misha Erementchouk
#+EMAIL: merement@gmail.com
#+DATE: <2026-06-28 Sun>
#+OPTIONS: tex: t LaTeX: t toc:nil ^:{}
#+KEYWORDS:
#+DESCRIPTION:

*** 2. The "Multi-App" Single Repository Structure

Instead of having one single =main()= function for the entire repository, the
repository houses the core components alongside several independent
applications (sub-projects).

The repository structure could look like this:

- *=components/=* /(The shared libraries)/
  - =ising_solver/= (Math, spin dynamics)
  - =network_comm/= (Wi-Fi, ESP-NOW, MQTT wrappers)
  - =hal_config/= (Pin definitions, hardware abstraction)
- *=apps/=* /(The executable sub-projects)/
  - =test_comm_module/= (A standalone =main= that only boots networking)
  - =test_solver_module/= (A standalone =main= that only runs math benchmarks)
  - =integration_main/= (The actual overarching project that links everything)
- *=.devcontainer/=* (Docker environment configuration)
- *=docs/=* (SOPs and Wiki)

#+begin_src plantuml
@startsalt
{
{T
  📁 project-root/
 + 📁 components/ (/ Shared libraries /)
 ++ 📁 ising_solver/ (/ spin dynamics /)
 ++ 📁 network_comm/ (/ communication modules, wrappers /)
 ++ 📁 hal_config/ (/ ? /)
 + 📁 apps/ (/ Executable sub-projects /)
 ++ 📁 test_comm_module/  (/ comm_module development /)
 ++ 📁 test_solver_module/ (/ ising module development /)
 ++ 📁 integration_main/=  (/ main project integrating everything /)
 + 📁 .devcontainer/ (/ hidden (?) Docker environment /)
 + 📁 docs/ (/ documentation and presentations /)
 ++ 📁 images/ (/ assets are separated (images, diagrams) /)
}
}
@endsalt
#+end_src  

#+RESULTS:
#+begin_example
                                                                                          
📁 project-root/                                                                    
      📁 components/ (/ Shared libraries /)                                     
            📁 ising_solver/ (/ spin dynamics /)                            
            📁 network_comm/ (/ communication modules, wrappers /)          
            📁 hal_config/ (/ ? /)                                          
      📁 apps/ (/ Executable sub-projects /)                                    
            📁 test_comm_module/  (/ comm_module development /)             
            📁 test_solver_module/ (/ ising module development /)           
            📁 integration_main/=  (/ main project integrating everything /)
      📁 .devcontainer/ (/ hidden (?) Docker environment /)                     
      📁 docs/ (/ documentation and presentations /)                            
            📁 images/ (/ assets are separated (images, diagrams) /)                           
#+end_example


